app/views/menus/new.html.erb

                <label class="block text-lg text-gray-600" for="title">Kategori Menu</label>
            <%= form.select :category_id, Category.all.collect {|x| [x.name, x.id]}, {}, class: 'w-1/3 px-3 py-2 text-gray-700 bg-gray-200 rounded' %>
---
SELECT "categories".* FROM "categories"