app/views/order_details/_form.html.erb

SELECT "orders".* FROM "orders"
---
    <%= form.label :OrderId, style: "display: block" %>
    <%= form.collection_select(:order_id, Order.all, :id, :customer_id, :prompt => 'Select') %>

SELECT "menus".* FROM "menus"
---
    <%= form.label :MenuId, style: "display: block" %>
    <%= form.collection_select(:menu_id, Menu.all, :id, :name, :prompt => 'Select') %>