app/views/orders/_form.html.erb

SELECT "customers".* FROM "customers"
---
    <label class="block text-lg text-gray-600" for="title">Customer</label>
    <%= form.collection_select(:customer_id, Customer.all, :id, :email, :prompt => 'Select') %>