app/views/orders/_order.html.erb

                <td class="text-left py-3 px-3"><%= 1 %></td>
                <td class="text-left py-3 px-3"><%= order.order_date %></td>
---
SELECT "orders".* FROM "orders"