app/views/carts/new.html.erb

SELECT "menus".* FROM "menus"
---
                <label class="block text-lg text-gray-600" for="title">Nama Pesanan</label>
                <%= form.select :name, Menu.all.collect {|x| [x.name, x.name]}, {}, class: 'w-1/3 px-3 py-2 text-gray-700 bg-gray-200 rounded' %>

SELECT "menus".* FROM "menus"
---
                <label class="block text-lg text-gray-600" for="title">Harga</label>
                <%= form.select :price, Menu.all.collect {|x| [x.price, x.price]}, {}, class: 'w-1/3 px-3 py-2 text-gray-700 bg-gray-200 rounded' %>