app/controllers/carts_controller.rb

  def create
    cart = Cart.create(cart_params)
---
INSERT INTO "carts" ("name", "price", "qty", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Pecel"], ["price", "20000"], ["qty", "2"], ["created_at", "2022-04-23 02:05:11.101444"], ["updated_at", "2022-04-23 02:05:11.101444"]]