app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    @categorys = Category.all

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Makanan"], ["created_at", "2022-04-21 23:46:13.044520"], ["updated_at", "2022-04-21 23:46:13.044520"]]
---
  def create
    category = Category.create(item_params)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Makanans"], ["updated_at", "2022-04-23 00:49:01.155128"], ["id", 1]]
---
  def update
    @category = Category.find(params[:id])
    @category.update(item_params)