app/controllers/menus_controller.rb

SELECT "menus".* FROM "menus" ORDER BY "menus"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @menus = Menu.all

INSERT INTO "menus" ("name", "price", "desc", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Pecel"], ["price", "20000"], ["desc", "pbl"], ["category_id", "1"], ["created_at", "2022-04-23 00:02:21.887704"], ["updated_at", "2022-04-23 00:02:21.887704"]]
---
  def create
    menu = Menu.create(menu_params)

SELECT "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def edit
    @menu = Menu.find(params[:id])

SELECT "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "menus" SET "category_id" = ?, "updated_at" = ? WHERE "menus"."id" = ?  [["category_id", "3"], ["updated_at", "2022-04-23 00:47:35.485805"], ["id", 1]]
---
  def update
    @menu = Menu.find(params[:id])
    @menu.update(menu_params)

SELECT "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "menus" WHERE "menus"."id" = ?  [["id", 1]]
---
  def destroy
    @menu = Menu.find(params[:id])
    @menu.destroy