app/controllers/order_details_controller.rb

SELECT "order_details".* FROM "order_details"
---
  def index
    @order_details = OrderDetail.all

SELECT "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_order_detail
      @order_detail = OrderDetail.find(params[:id])