app/controllers/orders_controller.rb

INSERT INTO "orders" ("order_date", "total_price", "payment_status", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save